; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v2)
		(pred_1 ?v7)
		(pred_3 ?v4)
		(pred_6 ?v4)
		(pred_2 ?v7 ?v4)
		(pred_4)
		(pred_5 ?v7))

   (:action op_2
       :parameters  (?v6 ?v1)
       :precondition (and (not-eq ?v6 ?v1) 
                          (pred_3 ?v6) (pred_3 ?v1) (pred_6 ?v6))
       :effect (and  (pred_6 ?v1)
		     (not (pred_6 ?v6))))


   (:action op_3
       :parameters (?v3 ?v8)
       :precondition  (and  (pred_1 ?v3) (pred_3 ?v8)
			    (pred_2 ?v3 ?v8) (pred_6 ?v8) (pred_4))
       :effect (and (pred_5 ?v3)
		    (not (pred_2 ?v3 ?v8)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v3  ?v8)
       :precondition  (and  (pred_1 ?v3) (pred_3 ?v8)
			    (pred_5 ?v3) (pred_6 ?v8))
       :effect (and (pred_2 ?v3 ?v8)
		    (pred_4)
		    (not (pred_5 ?v3)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_05 obj_08 obj_02 obj_06 obj_01 obj_03 
          obj_04 obj_07 
)
(:init
(pred_3 obj_05)
(pred_3 obj_08)
(pred_3 obj_02)
(pred_3 obj_06)
(pred_3 obj_01)
(pred_3 obj_03)
(pred_1 obj_04)
(pred_1 obj_07)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(pred_4)
(pred_2 obj_04 obj_03)
(pred_2 obj_07 obj_01)
(pred_6 obj_08)
)
(:goal
(and
(pred_2 obj_04 obj_02)
(pred_2 obj_07 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_04 obj_02) (pred_6 obj_05))
    (sometime-before  (pred_2 obj_07 obj_05) (pred_6 obj_02))
  )
)
)

; plan
1. (op_2 obj_08 obj_03)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_03)
   goals met: 0 of 2
2. (op_3 obj_04 obj_03)
   deleted: (pred_2 obj_04 obj_03) (pred_4)
   added: (pred_5 obj_04)
   goals met: 0 of 2
3. (op_2 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 0 of 2
4. (op_2 obj_01 obj_02)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_02)
   goals met: 0 of 2
5. (op_2 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 0 of 2
6. (op_1 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_2 obj_04 obj_05) (pred_4)
   goals met: 0 of 2
7. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 0 of 2
8. (op_3 obj_07 obj_01)
   deleted: (pred_2 obj_07 obj_01) (pred_4)
   added: (pred_5 obj_07)
   goals met: 0 of 2
9. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 2
10. (op_1 obj_07 obj_05)
   deleted: (pred_5 obj_07)
   added: (pred_2 obj_07 obj_05) (pred_4)
   goals met: 1 of 2
11. (op_3 obj_04 obj_05)
   deleted: (pred_2 obj_04 obj_05) (pred_4)
   added: (pred_5 obj_04)
   goals met: 1 of 2
12. (op_2 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 1 of 2
13. (op_1 obj_04 obj_02)
   deleted: (pred_5 obj_04)
   added: (pred_2 obj_04 obj_02) (pred_4)
   goals met: 2 of 2
